// 零号大坝
var dabaInfo = {
  width: 81086.304688,
  height: 80988.500000,
  boundsW: -250,
  boundsH: 250,
  centerX: 358155.687500,
  centerY: 750191.750000,
  minZoom: 3,
  initZoom: 3,
  initX: -85,
  initY: 110
}
// 地图区域坐标
var selectRegion = [
  {
      name: '军营',
      x: "336667.781250",
      y: "-793117.812500",
  },
  {
      name: '水泥厂',
      x: "336179.187500",
      y: "-776354.562500",
  },
  {
      name: '行政辖区',
      x: "364598.812500",
      y: "-787795.000000",
  },
  {
      name: '行政东楼',
      x: "368457.031250",
      y: "-786768.812500",
  },
  {
      name: '行政西楼',
      x: "362493.781250",
      y: "-789886.500000",
  },
  {
      name: '主变电站',
      x: "371413.062500",
      y: "-768131.250000",
  },
  {
      name: '游客中心',
      x: "392334.906250",
      y: "-750165.750000",
  },
  {
      name: '管道区域',
      x: "325340.718750",
      y: "-795599.500000",
  },
]

// 全部
var navList = [
  {
      titleType: 'all',
      title: '全部',
  },
  {
      titleType: 'wzd',
      title: '物资点',
  },
  {
      titleType: '首领',
      title: '首领',
  },
  {
      titleType: 'xdjqz',
      title: '行动接取站',
  }
]

// 单个大类
var navListInfo = [
  {
      titleType: 'all',
      title: '全部',
      typeList: [
        {
          "name": "保险柜",
          "idType": 1,
          "num": 15,
          "icon": "nav_bxx"
        },
        {
          "name": "小保险箱",
          "idType": 2,
          "num": 3,
          "icon": "nav_xbxx"
        },
        {
          "name": "服务器",
          "idType": 3,
          "num": 9,
          "icon": "nav_fwq"
        },
        {
          "name": "电脑",
          "idType": 4,
          "num": 17,
          "icon": "nav_dn"
        },
        {
          "name": "电脑机箱",
          "idType": 5,
          "num": 18,
          "icon": "nav_dnjx"
        },
        {
          "name": "电脑包",
          "idType": 25,
          "num": 5,
          "icon": "nav_dsb"
        },
        {
          "name": "武器箱",
          "idType": 6,
          "num": 3,
          "icon": "nav_wqx"
        },
        {
          "name": "大武器箱",
          "idType": 7,
          "num": 11,
          "icon": "nav_dwqx"
        },
        {
          "name": "弹药箱",
          "idType": 8,
          "num": 13,
          "icon": "nav_dyx"
        },
        {
          "name": "工具柜",
          "idType": 9,
          "num": 17,
          "icon": "nav_gjg"
        },
        {
          "name": "大工具盒",
          "idType": 10,
          "num": 21,
          "icon": "nav_dgjx"
        },
        {
          "name": "实验服",
          "idType": 11,
          "num": 11,
          "icon": "nav_yf_s"
        },
        {
          "name": "衣服",
          "idType": 12,
          "num": 11,
          "icon": "nav_yf"
        },
        {
          "name": "医疗包",
          "idType": 13,
          "num": 9,
          "icon": "nav_ylb"
        },
        {
          "name": "医疗物资堆",
          "idType": 14,
          "num": 5,
          "icon": "nav_ylwzd"
        },
        {
          "name": "旅行袋",
          "idType": 15,
          "num": 18,
          "icon": "nav_lxd"
        },
        {
          "name": "手提箱",
          "idType": 16,
          "num": 8,
          "icon": "nav_stx"
        },
        {
          "name": "储物柜",
          "idType": 17,
          "num": 14,
          "icon": "nav_cwg"
        },
        {
          "name": "高级储物箱",
          "idType": 18,
          "num": 1,
          "icon": "nav_gjcwx"
        },
        {
          "name": "抽屉柜",
          "idType": 19,
          "num": 4,
          "icon": "nav_ctg"
        },
        {
          "name": "登山包",
          "idType": 20,
          "num": 1,
          "icon": "nav_dsb"
        },
        {
          "name": "快递箱",
          "idType": 21,
          "num": 5,
          "icon": "nav_kdx"
        },
        {
          "name": "航空储物箱",
          "idType": 22,
          "num": 6,
          "icon": "nav_hkcwx"
        },
        {
          "name": "垃圾箱",
          "idType": 23,
          "num": 5,
          "icon": "nav_ljx"
        },
        {
          "name": "水泥车",
          "idType": 24,
          "num": 6,
          "icon": "nav_snc"
        },
        {
          "name": "野外物资箱",
          "idType": 25,
          "num": 12,
          "icon": "nav_ywwzx"
        },
        {
          "name": "鸟窝",
          "idType": 25,
          "num": 22,
          "icon": "nav_nw"
        },
        {
          "name": "藏匿物",
          "idType": 25,
          "num": 10,
          "icon": "nav_cnw"
        },
        {
          "name": "高级旅行箱",
          "idType": 25,
          "num": 5,
          "icon": "nav_xlx"
        },
          {
              name: '首领',
              idType: 28,
              num: 1,
              icon: 'nav_boss',
          },
          {
              name: '行动接取站',
              idType: 30,
              num: 20,
              icon: 'nav_xdjqz',
          },
          {
              name: '高价值接取站',
              idType: 30,
              num: 2,
              icon: 'nav_xdjqzgjz',
          },
      ]
  },
  {
    titleType: 'wzd',
    title: '物资点',
    typeList: [
      {
        name: "保险柜",
        idType: 1,
        num: 15,
        icon: "nav_bxx"
      },
      {
        name: "小保险箱",
        idType: 2,
        num: 3,
        icon: "nav_xbxx"
      },
      {
        name: "服务器",
        idType: 3,
        num: 9,
        icon: "nav_fwq"
      },
      {
        name: "电脑",
        idType: 4,
        num: 17,
        icon: "nav_dn"
      },
      {
        name: "电脑机箱",
        idType: 5,
        num: 18,
        icon: "nav_dnjx"
      },
      {
        name: "电脑包",
        idType: 25,
        num: 5,
        icon: "nav_dsb"
      },
      {
        name: "武器箱",
        idType: 6,
        num: 3,
        icon: "nav_wqx"
      },
      {
        name: "大武器箱",
        idType: 7,
        num: 11,
        icon: "nav_dwqx"
      },
      {
        name: "弹药箱",
        idType: 8,
        num: 13,
        icon: "nav_dyx"
      },
      {
        name: "工具柜",
        idType: 9,
        num: 17,
        icon: "nav_gjg"
      },
      {
        name: "大工具盒",
        idType: 10,
        num: 21,
        icon: "nav_dgjx"
      },
      {
        name: "实验服",
        idType: 11,
        num: 11,
        icon: "nav_yf_s"
      },
      {
        name: "衣服",
        idType: 12,
        num: 11,
        icon: "nav_yf"
      },
      {
        name: "医疗包",
        idType: 13,
        num: 9,
        icon: "nav_ylb"
      },
      {
        name: "医疗物资堆",
        idType: 14,
        num: 5,
        icon: "nav_ylwzd"
      },
      {
        name: "旅行袋",
        idType: 15,
        num: 18,
        icon: "nav_lxd"
      },
      {
        name: "手提箱",
        idType: 16,
        num: 8,
        icon: "nav_stx"
      },
      {
        name: "储物柜",
        idType: 17,
        num: 14,
        icon: "nav_cwg"
      },
      {
        name: "高级储物箱",
        idType: 18,
        num: 1,
        icon: "nav_gjcwx"
      },
      {
        name: "抽屉柜",
        idType: 19,
        num: 4,
        icon: "nav_ctg"
      },
      {
        name: "登山包",
        idType: 20,
        num: 1,
        icon: "nav_dsb"
      },
      {
        name: "快递箱",
        idType: 21,
        num: 5,
        icon: "nav_kdx"
      },
      {
        name: "航空储物箱",
        idType: 22,
        num: 6,
        icon: "nav_hkcwx"
      },
      {
        name: "垃圾箱",
        idType: 23,
        num: 5,
        icon: "nav_ljx"
      },
      {
        name: "水泥车",
        idType: 24,
        num: 6,
        icon: "nav_snc"
      },
      {
        name: "野外物资箱",
        idType: 25,
        num: 12,
        icon: "nav_ywwzx"
      },
      {
        name: "鸟窝",
        idType: 25,
        num: 22,
        icon: "nav_nw"
      },
      {
        name: "藏匿物",
        idType: 25,
        num: 10,
        icon: "nav_cnw"
      },
      {
        name: "高级旅行箱",
        idType: 25,
        num: 5,
        icon: "nav_xlx"
      }
    ]  
  },
  {
      titleType: '首领',
      title: '首领',
      typeList: [
          {
              name: '首领',
              idType: 29,
              num: 1,
              icon: 'nav_boss',
          }
      ]
  },
  {
      titleType: 'xdjqz',
      title: '行动接取站',
      typeList: [
          {
              name: '行动接取站',
              idType: 30,
              num: 20,
              icon: 'nav_xdjqz',
          },
          {
              name: '高价值接取站',
              idType: 30,
              num: 2,
              icon: 'nav_xdjqzgjz',
          },
      ]
  }
]

var localplayer = {
  "name": "LocalPlayer",
  "icon": "entity",
  "x": 336907.8125,
  "y": -782202.125,
}

var playerList = []
// 普通
var mapArticle = [
  {
    "地图": "大坝",
    "大区域": "大坝_合同",
    "自定义区域": "每局游戏随机刷新，可能出现在图示位置",
    "是否为散点": "FALSE",
    "倍场特殊配置": "默认全倍场",
    "z坐标": "-15448.37598",
    "拾取条件": "",
    "出现条件": "随机刷新",
    "name": "电脑",
    "icon": "dn",
    "x": 336907.8125,
    "y": -795202.125,
    "随机": "概率出现"
  },
  {
    "地图": "航天城",
    "大区域": "航天城_合同",
    "自定义区域": "行动奖励",
    "是否为散点": "FALSE",
    "name": "电脑包",
    "icon": "dsb",
    "倍场特殊配置": "默认全倍场",
    "x": "336907.8125",
    "y": "-797202.125",
    "z坐标": "-20469",
    "拾取条件": "需要完成局内行动才能开启"
},
  {
    "地图": "大坝",
    "大区域": "大坝_合同",
    "自定义区域": "每局游戏随机刷新，可能出现在图示位置",
    "是否为散点": "FALSE",
    "倍场特殊配置": "默认全倍场",
    "z坐标": "-16422",
    "拾取条件": "",
    "出现条件": "随机刷新",
    "name": "保险柜",
    "icon": "bxx",
    "x": "369631.375",
    "y": "-763656.8125",
    "随机": "概率出现"
  },
  {
      "地图": "大坝",
      "大区域": "大坝_合同",
      "自定义区域": "行动奖励",
      "是否为散点": "FALSE",
      "倍场特殊配置": "默认全倍场",
      "z坐标": "-16985.3",
      "拾取条件": "需要完成局内行动才能开启",
      "name": "实验服",
      "icon": "yf_s",
      "x": "341565.3",
      "y": "-780282"
    },
    {
      "地图": "大坝",
      "大区域": "大坝_合同",
      "自定义区域": "行动奖励",
      "是否为散点": "FALSE",
      "倍场特殊配置": "默认全倍场",
      "z坐标": "-16955.9",
      "拾取条件": "需要完成局内行动才能开启",
      "name": "衣服",
      "icon": "yf",
      "x": "363323.3",
      "y": "-756204"
    },
    {
      "地图": "大坝",
      "大区域": "大坝_行政楼",
      "自定义区域": "行政楼",
      "是否为散点": "FALSE",
      "倍场特殊配置": "默认全倍场",
      "z坐标": "-16202",
      "拾取条件": "",
      "name": "高级储物箱",
      "icon": "gjcwx",
      "x": "368919.6",
      "y": "-784665"
    },
    {
      "地图": "大坝",
      "大区域": "大坝_军营",
      "自定义区域": "军营",
      "是否为散点": "FALSE",
      "倍场特殊配置": "默认全倍场",
      "z坐标": "-15104.1",
      "拾取条件": "",
      "name": "快递箱",
      "icon": "kdx",
      "x": "336908.9",
      "y": "-794938"
    },
    {
      "地图": "大坝",
      "大区域": "大坝_河道",
      "自定义区域": "河道",
      "是否为散点": "FALSE",
      "倍场特殊配置": "默认全倍场",
      "z坐标": "-17635.9",
      "拾取条件": "",
      "name": "大工具盒",
      "icon": "dgjx",
      "x": "325316.1",
      "y": "-768013"
    },
    {
      "地图": "大坝",
      "大区域": "大坝_河道",
      "自定义区域": "河道",
      "是否为散点": "FALSE",
      "倍场特殊配置": "默认全倍场",
      "z坐标": "-17248.8",
      "拾取条件": "",
      "name": "弹药箱",
      "icon": "dyx",
      "x": "322812",
      "y": "-769326"
    },
    {
      "地图": "大坝",
      "大区域": "大坝_小变电站",
      "自定义区域": "小变电站",
      "是否为散点": "FALSE",
      "倍场特殊配置": "默认全倍场",
      "z坐标": "-16571.1",
      "拾取条件": "",
      "name": "小保险箱",
      "icon": "xbxx",
      "x": "363695.2",
      "y": "-756691"
    },
    {
      "地图": "大坝",
      "大区域": "大坝_野外",
      "自定义区域": "野外",
      "是否为散点": "FALSE",
      "倍场特殊配置": "默认全倍场",
      "z坐标": "-16870",
      "拾取条件": "",
      "name": "野外物资箱",
      "icon": "ywwzx",
      "x": "325842.6",
      "y": "-773876"
    },
    {
      "地图": "大坝",
      "大区域": "大坝_野外",
      "自定义区域": "野外",
      "是否为散点": "FALSE",
      "倍场特殊配置": "默认全倍场",
      "z坐标": "-15620.6",
      "拾取条件": "",
      "name": "垃圾箱",
      "icon": "ljx",
      "x": "387258.6",
      "y": "-764982"
    },
    {
      "地图": "大坝",
      "大区域": "大坝_河道",
      "自定义区域": "河道",
      "是否为散点": "FALSE",
      "倍场特殊配置": "默认全倍场",
      "z坐标": "-17679.2",
      "拾取条件": "",
      "name": "鸟窝",
      "icon": "nw",
      "x": "328079.2",
      "y": "-765843"
    },
    {
      "地图": "大坝",
      "大区域": "大坝_水泥厂",
      "自定义区域": "水泥厂",
      "是否为散点": "FALSE",
      "倍场特殊配置": "默认全倍场",
      "z坐标": "-17072.5",
      "拾取条件": "",
      "name": "藏匿物",
      "icon": "cnw",
      "x": "337433",
      "y": "-781759"
    },
    {
      "地图": "大坝",
      "大区域": "大坝_合同",
      "自定义区域": "行动奖励",
      "是否为散点": "FALSE",
      "倍场特殊配置": "默认全倍场",
      "z坐标": "-16993.7",
      "拾取条件": "需要完成局内行动才能开启",
      "name": "登山包",
      "icon": "dsb",
      "x": "341630.7",
      "y": "-780512"
    },
    {
      "地图": "大坝",
      "大区域": "大坝_水泥厂",
      "自定义区域": "水泥厂",
      "是否为散点": "FALSE",
      "倍场特殊配置": "默认全倍场",
      "z坐标": "-16652.4",
      "拾取条件": "需要使用钥匙卡才能开启",
      "name": "电脑机箱",
      "icon": "dnjx",
      "x": "330608.8",
      "y": "-773042"
    },
    {
      "地图": "大坝",
      "大区域": "大坝_水泥厂",
      "自定义区域": "水泥厂",
      "是否为散点": "FALSE",
      "倍场特殊配置": "默认全倍场",
      "z坐标": "-17019.5",
      "拾取条件": "",
      "name": "航空储物箱",
      "icon": "hkcwx",
      "x": "334636.5",
      "y": "-772792"
    },
    {
      "地图": "大坝",
      "大区域": "大坝_水泥厂",
      "自定义区域": "水泥厂",
      "是否为散点": "FALSE",
      "倍场特殊配置": "默认全倍场",
      "z坐标": "-16647.4",
      "拾取条件": "需要使用钥匙卡才能开启",
      "name": "高级旅行箱",
      "icon": "xlx",
      "x": "329766.4",
      "y": "-772961"
    },
    {
      "地图": "大坝",
      "大区域": "大坝_野外",
      "自定义区域": "野外",
      "是否为散点": "FALSE",
      "倍场特殊配置": "默认全倍场",
      "z坐标": "-15615.5",
      "拾取条件": "",
      "name": "医疗物资堆",
      "icon": "ylwzd",
      "x": "315624.9",
      "y": "-778258"
    },
    {
      "地图": "大坝",
      "大区域": "大坝_大变电站",
      "自定义区域": "大变电站",
      "是否为散点": "FALSE",
      "倍场特殊配置": "默认全倍场",
      "z坐标": "-16830.7",
      "拾取条件": "",
      "name": "旅行袋",
      "icon": "lxd",
      "x": "376268",
      "y": "-773466"
    },
    {
      "地图": "大坝",
      "大区域": "大坝_野外",
      "自定义区域": "野外",
      "是否为散点": "FALSE",
      "倍场特殊配置": "默认全倍场",
      "z坐标": "-15215.9",
      "拾取条件": "",
      "name": "工具柜",
      "icon": "gjg",
      "x": "321324.9",
      "y": "-790199"
    },
    {
      "地图": "大坝",
      "大区域": "大坝_军营",
      "自定义区域": "军营",
      "是否为散点": "FALSE",
      "倍场特殊配置": "默认全倍场",
      "z坐标": "-15193.7",
      "拾取条件": "需要使用钥匙卡才能开启",
      "name": "服务器",
      "icon": "fwq",
      "x": "337054.8",
      "y": "-795696"
    },
    {
      "地图": "大坝",
      "大区域": "大坝_行政楼",
      "自定义区域": "行政楼",
      "是否为散点": "FALSE",
      "倍场特殊配置": "默认全倍场",
      "z坐标": "-16651.2",
      "拾取条件": "需要使用钥匙卡才能开启",
      "name": "医疗包",
      "icon": "ylb",
      "x": "363707.8",
      "y": "-787242"
    },
    {
      "地图": "大坝",
      "大区域": "大坝_行政楼",
      "自定义区域": "行政楼",
      "是否为散点": "FALSE",
      "倍场特殊配置": "默认全倍场",
      "z坐标": "-16202",
      "拾取条件": "需要使用钥匙卡才能开启",
      "name": "抽屉柜",
      "icon": "ctg",
      "x": "367739.5",
      "y": "-784992"
    },
    {
      "地图": "大坝",
      "大区域": "大坝_合同",
      "自定义区域": "行动奖励",
      "是否为散点": "FALSE",
      "倍场特殊配置": "默认全倍场",
      "z坐标": "-16625.2",
      "拾取条件": "需要完成局内行动才能开启",
      "name": "手提箱",
      "icon": "stx",
      "x": "364007",
      "y": "-791504"
    },
    {
      "地图": "大坝",
      "大区域": "大坝_合同",
      "自定义区域": "行动奖励",
      "是否为散点": "FALSE",
      "倍场特殊配置": "默认全倍场",
      "z坐标": "-16745.4",
      "拾取条件": "需要完成局内行动才能开启",
      "name": "大武器箱",
      "icon": "dwqx",
      "x": "364234.3",
      "y": "-790741"
    },
    {
      "地图": "大坝",
      "大区域": "大坝_小变电站",
      "自定义区域": "小变电站",
      "是否为散点": "FALSE",
      "倍场特殊配置": "默认全倍场",
      "z坐标": "-16632",
      "拾取条件": "需要使用钥匙卡才能开启",
      "name": "储物柜",
      "icon": "cwg",
      "x": "363412.2",
      "y": "-756622"
    },
    {
      "地图": "大坝",
      "大区域": "大坝_水泥厂",
      "自定义区域": "水泥厂",
      "是否为散点": "FALSE",
      "倍场特殊配置": "默认全倍场",
      "z坐标": "-16013.6",
      "拾取条件": "",
      "name": "武器箱",
      "icon": "wqx",
      "x": "335242.7",
      "y": "-775124"
    },
    {
      "地图": "大坝",
      "大区域": "大坝_水泥厂",
      "自定义区域": "水泥厂",
      "是否为散点": "FALSE",
      "倍场特殊配置": "默认全倍场",
      "z坐标": "-17075.8",
      "拾取条件": "",
      "name": "水泥车",
      "icon": "snc",
      "x": "331660.8",
      "y": "-779118"
    },
  // Boss
  {
      "name": "[卫队长官]赛伊德",
      "typeName": "首领",
      "自定义区域": "可能出现在行政辖区内",
      "type": "Boss",
      "icon": 'boss',
      "x": "367549.062500",
      "y": "-785405.437500",
      "z": ""
  },
  // 行动接取站
  {
      "name": "行动接取站",
      "type": "move",
      "icon": 'xdjqz',
      "x": "334618.125000",
      "y": "-788692.500000",
      "z": ""
  },
  {
      "name": "高价值接取站",
      "type": "moves",
      "icon": 'xdjqzgjz',
      "x": "354700.062500",
      "y": "-780500.937500",
      "z": ""
  },
]
